'''(№ 2528) (П.Е. Финкель) Текстовый файл 24-1.txt состоит не более чем из 10**6 символов - заглавных
латинских букв и цифр. Определите максимальное число, состоящее только из чётных цифр. Под числом подразумевается
последовательность цифр, ограниченная другими символами (не цифрами).'''

# чтение в строку
t = open('24-1.txt').read()
# замена всех ненужных символов на *
for x in set(t):
    if x not in '02468':
        t = t.replace(x, '*')
# разрез по * и отбор всех непустых строк в виде (длина строки, строка)
ans = [(len(x), x) for x in t.split('*') if x]
print(max(ans), ans)

