'''(№ 2532) (В.Н. Шубинкин) Текстовый файл 24-1.txt состоит не более чем из 10 ** 6 символов - заглавных латинских
букв и цифр. Возрастающей подпоследовательностью будем называть непрерывную последовательность символов,
расположенных в порядке увеличения их номера в кодовой таблице символов ASCII. Найдите наибольшую возрастающую
подпоследовательность в этом файле, запишите в ответе номер символа в файле, с которого она начинается (нумерация
символов начинается с 1). Если таких последовательностей несколько, используйте первую из них.'''

t = open('24-11.txt').read().strip()
print(set(t))

m = 0
p = None
for l in range(len(t)):
    f = 1
    for r in range(l + m, len(t)):
        s = t[l: r + 1]
        if s == ''.join(sorted(set(s))):
            if len(s) > m:
                m = len(s)
                p = l + 1
                print(l, r, s)
        else:
            break
print(m, p)