'''(№ 3156) Текстовый файл 24-s2.txt состоит не более чем из 106 заглавных латинских букв.
Определите символ, который чаще всего встречается в файле сразу после буквы X. В ответе запишите сначала
этот символ, а потом сразу (без разделителя) сколько раз он встретился после буквы X. Если таких символов несколько,
нужно вывести тот, который стоит раньше в алфавите. Например, в тексте XBCXXBXDDD после буквы X два раза стоит B,
по одному разу – X и D. Для этого текста ответом будет B2.'''

t = [x[0] if x else '' for x in open('24-s2.txt').read().split('X')]
print(max((v, k) for k, v in {x: t.count(x) for x in set(t)}.items())[-5:])