'''(№3528) (А. Кабанов) Текстовый файл24-153.txtсодержит строку из заглавных букв A, B, C, D, E, F,
всего не более чем из 10**6символов.
DD-подстроками назовём последовательности символов A, B, C, E, F, ограниченные символами D
(граничные символы входят в подстроку).
Определите минимальную длину DD-подстроки. Подстроки, состоящие из двух символов, не учитывать.'''

t = open('24-153.txt').read().strip()
m = 10000
p = None
for l in range(len(t)):
    for r in range(l + m, l + 1, -1):
        s = t[l: r + 1]
        if s[0] != 'D': break
        if s[0] == s[-1] == 'D' and s.count('D') == 2:
            m = min(m, len(s))
            p = s
        elif s.count('D') < 2:
            break
    if l % 100000 == 0:
        print(l, r, m)
print(m, p)