'''Черепахе был дан для исполнения следующий алгоритм:
Повтори 15 [Вперёд 15 Направо 120]
Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией,
заданной данным алгоритмом. Точки на линии учитывать не следует.'''

from turtle import *
from math import *

m = 20
lt(90)

tracer(100)
for _ in range(5):
    fd(15 * m)
    rt(120)


up()
k = 0
for x in range(14):
    for y in range(16):
        if x > 0 and y < x * tan(5 * pi / 6) + 15 and y > x * tan(pi / 6):
            goto(x * m, y * m)
            dot(5, 'blue')
            k += 1
print(k)
done()
