''' Черепахе был дан для исполнения следующий алгоритм:
Направо 180
Повтори 9 [Вперёд 45 Налево 90 Вперёд 91 Налево 90]
Поднять хвост
Вперёд 15 Налево 90 Вперёд 18 Направо 90
Опустить хвост
Повтори 9 [Вперёд 128 Направо 90 Вперёд 92 Направо 90]
Определите периметр области пересечения фигур, ограниченных заданными алгоритмом линиями.'''

from turtle import *

m = 4
lt(90)

rt(180)
for _ in range(9):
    fd(45 * m)
    lt(90)
    fd(91 * m)
    lt(90)
up()
fd(15 * m)
lt(90)
fd(18 * m)
rt(90)
down()
for _ in range(9):
    fd(128 * m)
    rt(90)
    fd(92 * m)
    rt(90)
up()
tracer(100)
k = 0
for x in range(73, 92):
    for y in range(-30, 1):
        if (73 <= x <= 92 and y == 0) or (73 <= x <= 92 and y == -30) or (x == 73 and (-30 <= y <= 0)) or (x == 91 and (-30 <= y <= 0)):
            goto(x * m, y * m)
            dot(2, 'red')
            k += 1
print(k)    
done()