'''(№ 8753) 
Черепахе был дан для исполнения следующий алгоритм:
Повтори 2 [ Вперёд 142 Направо 120 ] 
Направо 300
Повтори 2 [ Вперёд 71 Направо 120 Вперёд 71 Налево 120 ]
Направо 300
Повтори 2 [ Вперёд 71 Налево 120 Вперёд 71 Направо 120 ]
Налево 180 Вперёд 71
Определите периметр фигуры, полученной в результате выполнения алгоритма.'''

from turtle import *

m = 2
lt(90)

for _ in range(2):
    fd(142 * m)
    rt(120)
rt(300)
for _ in range(2):
    fd(71 * m)
    rt(120)
    fd(71 * m)
    lt(120)
rt(300)
for _ in range(2):
    fd(71 * m)
    lt(120)
    fd(71 * m)
    rt(120)
lt(180)
fd(71 * m)

up()

tracer(100)
for x in range(124):
    for y in range(-36, 143):
        goto(x * m, y * m)
        dot(1, 'blue')
done()