'''Черепахе был дан алгоритм:
Повтори 3 [Вперед 39 Направо 90 Вперед 48 Направо 90]
Поднять хвост
Вперед 27 Нправо 90 Вперед 24 Налево 90
Опустить хвост
Повтори 3 [Вперед 29 Направо 90 Назад 18 Направо 90]
Определите площадь объединения фигур, ограниченных заданными алгоритмом линиями
'''

from turtle import *

tracer(5)
hideturtle()
lt(90)
m = 5
down()
for i in range(3):
    fd(39 * m)
    rt(90)
    fd(48 * m)
    rt(90)
up()
fd(27 * m)
rt(90)
fd(24 * m)
lt(90)
down()
for i in range(3):
    fd(29 * m)
    rt(90)
    bk(18 * m)
    rt(90)

up()
for x in range(49):
    for y in range(-17, 40):
        goto(x * m, y * m)
        if x == 0 and 0 <= y <= 39 or y == 0 and 0 <= x <= 48:
            dot(3, 'red')
        if -17 <= y <= 0 and x == 42 or y == -17 and 24 <= x <= 42:
            dot(3, 'blue')

done()

# a1 = 48, b1 = 39 -> S1 = 48 * 39
# a2 = 17, b2 = 18 -> S2 = 17 * 18
print(48 * 39 + 17 * 18)

# 2178