"""(№ 7) На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. К этой записи дописываются справа ещё два разряда по следующему правилу:
а) складываются все цифры двоичной записи, и остаток от деления суммы на 2 дописывается в конец числа (справа).
Например, запись 11100 преобразуется в запись 111001;
б) над этой записью производятся те же действия – справа дописывается остаток от деления суммы цифр на 2.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной
записью искомого числа R. Укажите такое наименьшее число N, для которого результат работы алгоритма больше 125.
В ответе это число запишите в десятичной системе счисления. """

for n in range(25, 120):
    nn = bin(n)[2:]
    nn = nn + str(nn.count('1') % 2)
    nn = nn + str(nn.count('1') % 2)
    r = int(nn, 2)
    if r > 125:
        print(n)
        break


r = '12344321'
r = r[:len(r)//2] + '0' + r[len(r)//2:]
print(r)

def fun(n, m):
    s = ''
    if n == 0:
        return '0'
    alph = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'
    while n > 0:
        s = alph[n % m] + s
        n //= m
    return s

ans = []
for n in range(1, 1000):
    r = fun(n,3)
    r = r + fun(r.count('2'),3)
    r = r + fun(r.count('1'),3)
    r = r + fun(r.count('0'),3)
    if int(r,3) < 1000:
        ans.append(n)
print(max(ans))
