"""(№ 7370) (Н. Леко) Автомат обрабатывает десятичное целое число N (0 ≤ N ≤ 255) по следующему алгоритму:
1. Строится восьмибитная двоичная запись числа N.
2. Все разряды двоичной записи инвертируются (0 заменяется на 1, 1 на 0).
3. Если полученное число кратно 5, то в двоичной записи старшие три разряда заменяются на 100, в противном случае
в двоичной записи старшие три разряда заменяются на 101.
Полученная таким образом запись является двоичной записью искомого числа R. Сколько существует чисел N, из которых
в результате выполнения алгоритма может получиться число 180?"""

k = 0
for n in range(256):
    # инверсия через математику
    nn = bin(255 - n)[2:]
    nn = '0' * (8 - len(nn)) + nn
    if int(nn, 2) % 5 == 0:
        nn = '100' + nn[3:]
    else:
        nn = '101' + nn[3:]
    r = int(nn, 2)
    if r == 180:
        k += 1
print(k)