'''(Апробация-2026) На вход алгоритма подается натуральное число N. Алгоритм строит по нему новое число R следующим образом:
1. Строится троичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
    a) если число N делится на 3, то слева к нему приписывается «1», а справа «02»;
    б) если число N на 3 не делится, то остаток от деления на 3 умножается на 5, переводится в троичную запись
    и дописывается в конец числа.
Полученная таким образом запись является троичной записью искомого числа R. Например, для исходного числа 11 = 102(3)
результатом является число 102101(3) = 307, а для исходного числа 12 = 110(3) результатом является число 111002(3) = 353.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, не меньшее 177.
В ответе запишите это число в десятичной системе счисления.'''

# алфавит через ASCII-таблицу
alf = '0123456789' + ''.join([chr(i) for i in range(ord('a'), ord('z') + 1)])
print(alf)

def conv(n: int, q: int) -> str:
    # перевод в систему счисления с основанием 2 <= q <= 36
    if n == 0:
        return '0'
    s = ''
    while n > 0:
        s = alf[n % q] + s
        n //= q
    return s

ans = []
for n in range(6, 1000):
    nn = conv(n, 3)
    if n % 3 == 0:
        nn = '1' + nn + '02'
    else:
        nn = nn + conv(n % 3 * 5, 3)
    r = int(nn, 3)
    if r >= 177:
        ans.append(n)
print(min(ans))
















