'''(№ 9080) (ЕГЭ-2026) На вход алгоритма подается натуральное число N. Алгоритм строит по нему новое число R
следующим образом:
1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
    a) если сумма цифр в двоичной записи числа чётная, то к этой записи справа дописывается 0, а затем
    два левых разряда заменяются на 10;
    б) если сумма цифр в двоичной записи числа нечётная, то к этой записи справа дописывается 1, а затем
    два левых разряда заменяются на 11.
Полученная таким образом является двоичной записью искомого числа R. Например, для исходного числа 6 = 110(2)
результатом является число 1000(2) = 8, а для исходного числа 4 = 100(2) результатом является число 1101(2) = 13.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, не меньшее 16.
В ответе запишите это число в десятичной системе счисления.'''

for n in range(1, 50):
    nn = bin(n)[2:]
    if nn.count('1') % 2:
        nn = '11' + nn[2:] + '1'
    else:
        nn = '10' + nn[2:] + '0'
    r = int(nn, 2)
    if r >= 16:
        print(n, nn)
        break