'''Сложнее ЕГЭ. На вход программе подаётся натуральное трёхзначное десятичное число N. Программа преобразует это число
в новое число R следующим образом:
Строится его шестнадцатеричная запись числа N
Все цифры полученного шестнадцатеричного числа, кроме F увеличиваются на 1
Полученное число записывается в обратном порядке и переводится в десятичную систему счисления
Сумма цифр десятичного числа выводится на экран
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, равное 12.
В ответе запишите это число в десятичной системе счисления.'''

for n in range(100, 1000):
    nn = hex(n)[2:]
    # print(nn)
    nn = ''.join(hex(int(x, 16) + 1)[2:] if x != 'f' else x for x in nn )[::-1]
    # print(nn)
    r = int(nn, 16)
    s = sum(int(x) for x in str(r))
    if s == 12:
        print(n)
        break
