'''Сложнее ЕГЭ. На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R:
Число N переводится в троичную систему счисления.
Далее в этой записи заменяются цифры: 1 на 2, 2 на 0, 0 на 1.
Незначащие нули удаляются.
Запись переворачивается справа налево.
К записи справа приписывается сумма цифр, записанная в троичной системе счисления.
Полученное таким образом число — троичная запись искомого числа R.
Укажите минимальное число R, большее 10**4, которое может получиться с помощью этого алгоритма.
В ответе запишите число R в десятичной системе счисления.'''

def per(n):
    if n == 0:
        return '0'
    alf = '012'
    s = ''
    while n > 0:
        s = alf[n % 3] + s
        n //= 3
    return s

ans = []
for n in range(1, 100000):
    nn = per(n)
    nn = nn.replace('1', '3').replace('0', '1').replace('2', '0').replace('3', '2')
    nn = str(int(nn))[::-1]
    nn = nn + per(sum(int(x) for x in nn))
    r = int(nn, 3)
    if r > 10 ** 4:
        ans.append(r)
print(min(ans))

