""" Сложнее ЕГЭ. На вход программы подаётся натуральное число N. Программа преобразует это число в новое число R
следующим образом:
Строится семеричная запись числа N.
В полученном числе все нечётные цифры увеличиваются на 1.
Далее находится сумма цифр полученного числа.
Найденная сумма переводится в семеричную систему счисления и дописывается в начало числа.
Далее, если полученное число начинается на нечётную цифру, эта цифра дублируется в начало числа.
Полученное число переводится в десятичную систему и выводится на экран.
Определите минимальное число R, большее 2000, которое может быть получено с помощью описанного алгоритма.
В ответе укажите это число в десятичной системе счисления."""

def per(n):
    if n == 0:
        return '0'
    alf = '0123456'
    s = ''
    while n > 0:
        s = alf[n % 7] + s
        n //= 7
    return s


ans = []
for n in range(1, 10000):
    nn = per(n)
    nn = ''.join(per(int(x) + 1) if int(x) % 2 else x for x in nn)
    nn = per(sum(int(x) for x in nn)) + nn
    nn = nn[0] + nn if int(nn[0]) % 2 else nn
    r = int(nn, 7)
    if r > 2000:
        ans.append(r)
print(min(ans))