'''Сложнее ЕГЭ. На вход программы подаётся натуральное число N. Программа преобразует это число в новое число R
следующим образом:
Число N преобразуется в шестеричную систему счисления.
Если в полученной записи число нулей не менее 2, то все нули заменяются на цифру 5, в противном случае запись не изменяется.
Далее эта запись обрабатывается согласно следующему алгоритму:
а. Если первая цифра шестеричной записи числа N чётная, то к числу слева дописывается остаток от деления N на 6
в шестеричной системе счисления.
б. Если первая цифра шестеричной записи числа N нечётная, то произведение цифр шестеричной записи числа переводится
в шестеричную систему счисления и дописывается в конец.
Полученное число переводится в десятичную систему счисления.
Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число R, меньшее 109.'''

def per(n):
    if n == 0:
        return '0'
    alf = '012345'
    s = ''
    while n > 0:
        s = alf[n % 6] + s
        n //= 6
    return s

ans = []
for n in range(1, 1000):
    nn = per(n)
    nn = nn.replace('0', '5') if nn.count('0') >= 2 else nn
    if int(nn[0]) % 2 == 0:
        nn = str(int(nn, 6) % 6) + nn
    else:
        p = 1
        for x in nn:
            p *= int(x)
        nn = nn + per(p)
    r = int(nn, 6)
    if r < 109:
        ans.append((n, r))
print(max(ans))
