'''
На числовой прямой даны три отрезка: P = [55; 57], O = [22; 98] и D = [20, 150]. Укажите
наименьшую возможную длину такого отрезка A, что логическое выражение
(x /∈ A) → ((x ∈ P) ∨ (x /∈ O) ∨ (x /∈ D))
истинно (т.е. принимает значение 1) при любом значении переменной x.
'''

p = [55, 57]
o = [22, 98]
d = [20, 150]
otr = sorted(p + o + d)
ans = []
for a1 in otr:
    for a2 in otr:
        if a1 < a2:
            a = [a1, a2]
            f = 1
            for x in range(otr[0] + 3, otr[1] + 4):
                if ((not(a[0] <= x <= a[1])) <= ((p[0] <= x <= p[1]) or (not(o[0] <= x <= o[1])) or (not(d[0] <= x <= d[1])))) == 0:
                    f = 0
                    break
            if f:
                ans.append((a2 - a1, a1, a2))
print(ans)