'''
Заданы два отрезка P = [3; 18] и Q = [11; 24], лежащие на числовой прямой.
Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
((x ∈ P) ∧ (x ∈ Q)) → (x ∈ A)
истинно (т. е. принимает значение 1) при любом значении переменной x.
'''

p = [3, 18]
q = [11, 24]
otr = sorted(p + q)
ans = []
for a1 in otr:
    for a2 in otr:
        if a1 < a2:
            a = [a1, a2]
            f = 1
            for x in range(otr[0] + 3, otr[1] + 4):
                if (((p[0] <= x <= p[1]) and (q[0] <= x <= q[1])) <= (a[0] <= x <= a[1])) == 0:
                    f = 0
                    break
            if f:
                ans.append((a2 - a1, a1, a2))
print(min(ans))