'''(№ 8480) (ЕГКР-2025) Алгоритм вычисления функций F(n) и G(n), где n – целое число, задан следующими соотношениями:
F(n) = F(n – 4) + 3580, если n ≥ 19;
F(n) = 6 · (G(n – 7) – 36), если n < 19;
G(n) = n / 20 + 28, если n ≥ 248045;
G(n) = G(n + 9) – 4, если n < 248045.
Здесь знак деления / означает деление нацело. Чему равно значение F(673)?'''
import sys

sys.setrecursionlimit(50000)
def f(n):
    if n >= 19:
        return f(n - 4) + 3580
    else:
        return 6 * (g(n - 7) - 36)

def g(n):
    if n >= 248045:
        return n // 20 + 28
    else:
        return g(n + 9) - 4

print(f(673))

k = [0] * 250_001
h = [0] * 250_001
for n in range(250_000, 0, -1):
    if n >= 248_045:
        k[n] = n // 20 + 28
    else:
        k[n] = k[n + 9] - 4
for n in range(4, 250_000):
    if n >= 19:
        h[n] = h[n - 4] + 3580
    else:
        h[n] = 6 * (k[n - 7] - 36)
print(h[673])