'''(№ 9158) (ЕГЭ-2026) Алгоритм вычисления функции F(n), где n – натуральное число, задан следующими соотношениями:
F(n) = 1, если n = 1;
F(n) = (n + 1) • F(n – 1), если n > 1.
Чему равно значение (F(42038) + 3·F(42037)) / F(42036)?'''

# прикинуть глубину погружения рекурсии
# 42038 / 1 = 42038 (по умолчанию - 998)
# лучше решать не рекурсией, может не потянуть комп - идеально ручное решение

# можно еще инвариантом через список
f = [0] * 42039
for n in range(42039):
    if n == 1:
        f[n] = 1
    elif n > 1:
        f[n] = (n + 1) * f[n - 1]
print((f[42038] + 3 * f[42037]) // f[42036])


from functools import lru_cache
import sys

sys.setrecursionlimit(100000)

@lru_cache(maxsize=128)
def f(n):
    if n == 1:
        return 1
    elif n > 1:
        return (n + 1) * f(n - 1)

print((f(42038) + 3 * f(42037)) / f(42036))

