"""(№ 9044) (Апробация-2026) На рисунке справа схема дорог Н-ского района изображена в виде графа,
в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали
независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными
обозначениями на графе.
Определите сумму протяженностей дорог из пункта B в пункт H и из пункта A в пункт E. В ответе запишите целое число.
"""

from itertools import permutations

table = {1: [5,6,7], 2: [3,4,8], 3: [2,7,8], 4: [2,7], 5: [1,6,8], 6: [1,5], 7: [1,3,4], 8: [2,3,5]}
graph = {'A': set('BHE'), 'B': set('AH'), 'C': set('EGD'), 'D': set('FC'), 'E': set('AGC'), 'F': set('HGD'), 'G': set('FEC'), 'H': set('ABF')}

for p in permutations('ABCDEFGH'):
    tmp = {p[k-1]: set(p[x - 1] for x in v) for k, v in table.items()}
    if tmp == graph:
        print('1 2 3 4 5 6 7 8')
        print(*p)