"""(№ 9047) (ЕГЭ-2026) На рисунке справа схема дорог Н-ского района изображена в виде графа,
в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали
независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными
обозначениями на графе.
Определите сумму протяженностей дорог из пункта B в пункт C и из пункта A в пункт C. В ответе запишите целое число."""

from itertools import permutations

table = {1: [3,6,7], 2: [3, 4,6], 3: [1,2, 4], 4: [2, 3, 7], 5: [6, 7], 6: [1, 2, 5], 7: [1,4,5]}
graph = {'A': set('DCF'), 'B': set('CEF'), 'C': set('GBA'), 'D': set('AGE'), 'E': set('DGB'), 'F': set('AB'), 'G': set('DEC')}

for p in permutations('ABCDEFG'):
    tmp = {p[k - 1]: set(p[x - 1] for x in v) for k, v in table.items()}
    # print(tmp)
    if tmp == graph:
        print('1 2 3 4 5 6 7')
        print(*p)




