'''(2486) Исполнитель Калькулятор преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
1. Прибавить 1
2. Умножить на 4
Программа для исполнителя Калькулятор - это последовательность команд. Сколько есть программ, которые число 1
преобразуют в число 32?'''

def f(n):
    global end
    # терминальная ветка - выход - выдача 1 для счетчика путей
    if n == end:
        return 1
    # обрубание ненужных веток - вышли за условие окончания
    elif n > end:
        return 0
    # рекуррентная ветка - вызовы обязательно через +, тк это счетчик
    else:
        return f(n + 1) + f(n * 4)

# главная программа
start = 1
end = 32
print(f(start))