'''(№ 4040) Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть две команды, которым присвоены номера:
1. Прибавь 1
2. Умножь на 2 и вычти 3
Сколько различных результатов можно получить из исходного числа 3 после выполнения программы,
содержащей ровно 12 команд?'''

def f(n, k):
    global ans
    if k == 12:
        ans.append(n)
        return 1
    elif k > 12:
        return 0
    return f(n + 1, k + 1) + f(n * 2 - 3, k + 1)

ans = []
f(3, 0)
print(len(ans))
print(len(set(ans)))
