'''	(№ 6543) (М. Шагитов) У исполнителя Калькулятор имеются три команды, которым присвоены номера:
1. прибавь 3
2. прибавь 5
3. умножь на 2
Выполняя первую из них, исполнитель увеличивает число на экране на 3, выполняя вторую – увеличивает на 5,
выполняя третью – умножает число на 2.
Укажите количество программ, которые преобразуют число 4 в число 68 и при этом траектория вычислений программы
содержит число 16 или 32, но не оба эти числа одновременно.'''

def f(n, k16, k32):
    if n == 68:
        if k16 + k32 == 1:
            return 1
        return 0
    elif n > 68:
        return 0
    elif n == 16:
        k16 = 1
    elif n == 32:
        k32 = 1
    return f(n + 3, k16, k32) + f(n + 5, k16, k32) + f(n * 2, k16, k32)

print(f(4, 0,0))