'''(№9040) (И. Карпачёв) У исполнителя имеются две команды, которые обозначены латинскими буквами:
A. Вычти 1
B. Раздели на наименьший простой делитель
Первая из этих команд уменьшает число на экране на 1. Вторая команда делит заменяет число на экране на
его наименьший простой делитель. Эту команду можно применять только к составным числам, к простым числам и единице
данная команда неприменима. Сколько существует команд, для которых при исходном числе 150 результатом является 7?'''

def isprime(n):
    for d in range(2, round(n ** 0.5) + 1):
        if n % d == 0:
            return d
    return 0

def f(n):
    global end
    if n == end:
        return 1
    elif n < end:
        return 0
    else:
        y = isprime(n)
        if y:
            return f(n - 1) + f(n // y)
        else:
            return f(n - 1)

start = 150
end = 7
print(f(start))