'''(№ 6366) Логические функции F1 и F2 задаются выражениями
F1 = (w → y) ≡ (z → x),    F2 = (w → y) ∧ (¬x ≡ z).
На рисунке приведён частично заполненный фрагмент таблицы истинности этих функций,
содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности
соответствует каждая из переменных x, y, z, w.'''

from itertools import product

print('x y z w')
for x, y, z, w in product([0, 1], repeat=4):
    f1 = (w <= y) == (z <= x)
    f2 = (w <= y) and (z == (not(x)))
    if f1 == 1 and f2 == 0:
        print(x, y, z, w)