'''(№ 6616) (Е. Джобс) Логические функции F1 и F2 задаются выражениями
    F1 = (x → y) ∨ (¬w  ≡ z),   F2 = (x → y) ≡ (w ∧ ¬z).
На рисунке приведёны частично заполненные три различные строки таблицы истинности этих функций,
в которых значения функций F1 и F2 равны.
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы.
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
'''

from itertools import product

print('x y z w')
alf = [0, 1]
# print('x y z w')
for x in alf:
    for y in alf:
        for z in alf:
            for w in alf:
# for x, y, z, w in product([0, 1], repeat=4):
                f1 = (x <= y) or ((not(w)) == z)
                f2 = (x <= y) == (w and (not(z)))
                if f1 == f2:
                    print(x, y, z, w)





