'''(№ 7901) *Логическая функция F задаётся выражением (x ≡ (y → z)) ∧ (y ≡ ¬(z → w)). На рисунке приведён
частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите,
какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы. Буквы в ответе
пишите подряд, никаких разделителей между буквами ставить не нужно.'''

# 1
print('x y z w')
for x in [0, 1]:
    for y in [0, 1]:
        for z in [0, 1]:
            for w in [0, 1]:
                f = (x == (y <= z)) and (y == (not(z <= w)))
                if f == 1:
                    print(x, y, z, w)

# 2
from itertools import product

# print('x y z w')
# for x, y, z, w in product([0, 1], repeat=4):
#     f = (x == (y <= z)) and (y == (not(z <= w)))
#     if f == 1:
#         print(x, y, z, w)
