'''Миша заполнял таблицу истинности логической функции F = ((w≡1)→z)∧((¬y)∧x), строки не повторяются,
но успел заполнить только фрагмент из четырёх различных её строк, даже не указав, каким столбцам таблицы
соответствуют переменные w, x, y, z.
 ?   ?   ?   ?   F
 0   0   1   ?   0
 0   1   1   0   0
 ?   ?   1   0   0
 0   ?   1   0   1
Определите это соответствие. В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им
столбцы (сначала буква, которая соответствует первому столбцу; затем буква, которая соответствует второму столбцу,
и т. д.). Буквы в ответе пишите подряд, никаких разделителей между ними ставить не нужно.'''


from itertools import *

# ((w≡1)→z)∧((¬y)∧x)
def v(x, y, z, w):
    return ((w == 1) <= z) and ((not(y)) and x)

for a, b, c, d in product([0,1], repeat=4):
    t = ((0,0,1,a,0),
         (0,1,1,0,0),
         (b,c,1,0,0),
         (0,d,1,0,1))
    if len(set(t)) == 4:  # 4 строки в табл, сет - нужен для удаления один строк
        for p in permutations('wxyz'):
            if all(v(**dict(zip(p,r))) == r[-1] for r in t):
                print(*p, sep='')




