'''Миша заполнял таблицу истинности логической функции F = (x∧y)∨((z≡y)∧w), строки не повтояются,
но успел заполнить только фрагмент из четырёх различных её строк, даже не указав, какому столбцу таблицы
соответствуют переменные w, x, y, z.
 ?   ?   ?   ?   F
 ?   ?   1   1   0
 ?   0   0   ?   0
 ?   0	 ?   0   1
 ?   0   0   0   1
Определите это соответствие. В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие
им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.).
Буквы в ответе пишите подряд, никаких разделителей между ними ставить не нужно.'''

from itertools import product, permutations

def v(x, y, z, w):
    return (x and y) or ((z == y) and w)

for a,b,c,d,e,f,g in product([0,1], repeat=7):
    t = ((a,b,1,1,0),
         (c,0,0,d,0),
         (e,0,f,0,1),
         (g,0,0,0,1))
    if len(set(t)) == 4:
        for p in permutations('xwzy'):
            if all(v(**dict(zip(p,r))) == r[-1] for r in t):
                print(*p, sep='')
