'''Миша заполнял таблицу истинности логической функции F = (¬((y→w)≡x))∧u, строки не повтояются,
но успел заполнить только фрагмент из четырёх различных её строк, даже не указав, какому столбцу таблицы
соответствуют переменные w, x, y, u.
 ?   ?   ?   ?   F
 0   1   0   ?   0
 0   1   1   1   0
 1   0	 1   ?   1
 1   ?   1   1   1
Определите это соответствие. В ответе напишите буквы w, x, y, u в том порядке, в котором идут соответствующие
им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.).
Буквы в ответе пишите подряд, никаких разделителей между ними ставить не нужно.'''

print('y w x u')

def f(x, y, w, u):
    return (not((y <= w) == x)) and u

for x in [0,1]:
    for y in [0,1]:
        for w in [0,1]:
            for u in [0,1]:
                # сначала разберем две строки со значением 1, потом - со значением 0
                if f(x, y, w, u) == 1:
                    print(y,w,x,u)