"""(Досрочный ЕГЭ-2025) Виктор составляет таблицу кодовых слов для передачи сообщений, каждому сообщению
соответствует своё кодовое слово. В качестве кодовых слов Виктор использует 5-буквенные слова, в которых могут
быть только буквы Д, Г, И, А, Ш, Э, причём слово не должно начинаться с гласной и не должно заканчиваться согласной.
Сколько различных кодовых слов может использовать Виктор?"""

from itertools import *

alf = 'ДГИАШЭ'
gl = 'ИАЭ'
sgl = 'ДГШ'
ans = []
for s in product(alf, repeat=5):
    sl = ''.join(s)
    if sl[0] not in gl:
        if sl[-1] not in sgl:
            ans.append(sl)
print(len(ans), len(set(ans)))