'''(№ 9103) (ЕГЭ-2026) Все шестибуквенные слова, составленные из букв Ц, В, Е, Т, О, К, записаны в алфавитном
порядке и пронумерованы. Вот начало списка:
1. BBBBBB
2. ВВВВВЕ
3. ВВВВВК
4. ВВВВВО
5. ВВВВВТ
6. ВВВВВЦ
...
Определите в этом списке количество слов с нечётными номерами, в записи которых не содержится ни одной из
букв Е или К и при этом имеется ровно две буквы О и ровно одна буква Ц.'''

from itertools import product

alf = sorted('ЦВЕТОК')
ans = []
for k, s in enumerate(product(alf, repeat=6), 1):
    if k % 2:
        if s.count('Е') == 0 and s.count('К') == 0 and s.count('О') == 2 and s.count('Ц') == 1:
            ans.append(s)
print(len(ans))


