'''(№ 9166) (ЕГЭ-2026) В файле 17-475.txt содержится последовательность целых чисел.
Её элементы по модулю не превышают 100 000 включительно. Определите количество троек элементов последовательности,
в которых ровно два элемента из трёх оканчиваются на 3 и являются четырёхзначными числами, а сумма всех элементов
тройки больше максимального элемента последовательности, оканчивающегося на 3 и являющегося четырёхзначным числом.
В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек.
B данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.'''

data = [int(x) for x in open('17-475.txt').readlines()]
print(data[:10])
# нашли за один проход макс эл-то, оканч на 3 и четырехзначный
max3 = max([x for x in data if 1000 <= abs(x) <= 9999 and abs(x) % 10 == 3])
print(max3)
# второй проход - сравнение троек по условию
k = 0
maxx = -10 ** 10
for i in range(len(data) - 2):
    tr = data[i:i + 3]
    end3 = [x for x in tr if 1000 <= abs(x) <= 9999 and abs(x) % 10 == 3]
    if len(end3) == 2:
        if sum(tr) > max3:
            k += 1
            maxx = max(maxx, sum(tr))
print(k, maxx)