'''(№ 7279) В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает,
какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети.
Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.
Узлы с IP-адресами 211.188.211.49 и 211.188.200.115 находятся в одной сети. Укажите наибольшее возможное
значение третьего слева байта маски этой сети. Ответ запишите в виде десятичного числа.'''

from ipaddress import *

# создаем объект адреса из первого адреса
ip1 = ip_address('211.188.211.49')
# инициализируем максимум
maxx = -100
# перебираем все возможные префексы маски - кол-во единиц в маске
for mask in range(19, 33):
    # зная префикс, создаем IP сети из второго адреса и префикса маски
    ip_net = ip_interface(f'211.188.200.115/{mask}').network
    # проверяем, чтобы наш первый адрес был в полученной сети
    if ip1 in ip_net:
        # если первый адрес в сети, получаем третий байт маски
        m = int(str(ip_net.netmask).split('.')[2])
        print(ip_net.netmask)
        # отрабатываем его на максимум
        maxx = max(m, maxx)
print(maxx)